# coding:utf-8
import requests
from bs4 import BeautifulSoup
import operator as op
import re
import urllib
import xlwt
#药材-资讯信息
def saveBase():
    yaocaiName = ['灵芝孢子粉', '沙棘果粉', '辣根片', '麦芽', '谷芽', '紫河车', '儿茶', '淡豆豉', '人中白', '樟脑', '冰片', '稻芽', '益母草粉', '冬瓜皮', '玉米须',
                  '艾条', '枯矾', '巴豆霜', '獾子油', '薄荷油', '神曲', '燕窝', '鳖甲', '蚕沙', '蛤壳', '蝉蜕', '蟾皮', '麝香', '玳瑁', '地龙', '蜂房',
                  '蛤蚧', '龟甲', '海龙', '狗鞭', '马宝', '鹿角', '蚂蚁', '蜻蜓', '虻虫', '牛黄', '蕲蛇', '猴枣', '干水蛭', '壁虎干', '鱼鳔', '珍珠',
                  '僵蚕', '全蝎', '蜣螂', '蛇蜕', '蝼蛄干', '蛴螬', '鼠妇', '羊鞭', '干蚯蚓', '富氧林蛙', '黄花胶', '龙虱', '鲍鱼壳', '獐宝', '九香虫',
                  '蜈蚣干', '蛞蝓干', '海螵蛸', '刺猬皮', '牛宝', '猪宝', '五灵脂', '蛤蟆油', '金沙牛', '石决明', '地牯牛', '石蚕', '海麻雀', '海马', '水牛角',
                  '鸡内金', '夜明砂', '鹿茸', '乌梢蛇', '蛇胆', '蛇干', '鱼宝', '艾', '荷叶', '桑叶', '石韦', '莽草', '香叶', '甜茶', '棕榈叶', '枸杞叶',
                  '杜仲叶', '沙棘叶', '大青叶', '半枫荷', '青钱柳叶', '蒲公英叶', '淫羊藿', '丁香叶', '五倍子', '罗布麻叶', '红豆杉枝叶', '枇杷叶', '山楂叶', '木豆叶',
                  '败火草', '火炭母', '香菊', '一朵云叶', '罗勒叶', '铁树叶', '铁将军', '银杏叶', '云南美登木', '鬼箭羽', '巴豆', '豆蔻', '白果', '蒺藜', '荜茇',
                  '槟榔', '蕤仁', '佛手片', '青果', '广枣', '榠樝', '诃子', '鹤虱', '槐角', '芥子', '橘核', '橘络', '香砂', '沙棘', '连翘', '芡实', '青皮',
                  '瓜蒌', '桑葚干', '砂仁', '栀子', '水栀', '桃仁', '干乌梅', '香橼', '益智', '枳壳', '枣核', '枳实', '榧子', '胖大海', '辣木籽', '王不留行',
                  '草蔻', '五味子', '牡丹籽', '茱萸', '灰苏子', '金樱子', '葡萄籽', '莲心', '地肤子', '决明子', '黄金果', '火麻', '马牯', '白苏籽', '紫苏子',
                  '火麻仁', '八月瓜片', '罗汉果干', '化橘红', '酸枣仁', '槟榔花', '穿心莲', '文冠果', '柏树果', '蛇床子', '仁用杏', '覆盆子', '女贞子', '水飞蓟',
                  '屈头鸡', '马槟榔', '山捻子', '木姜子', '便秘果', '苍耳子', '葶苈子', '佛手果', '苦豆子', '石榴皮', '补骨脂', '牵牛子', '白芥子', '沙苑子',
                  '青葙子', '枳椇子', '海金沙', '乌榄', '乌榄仁', '橄榄仁', '路路通', '白花菜子', '川楝子', '楮实子', '马钱子', '天茄子', '小叶鼠李', '皂荚',
                  '木鳖子', '棉花子', '竹米', '柏子仁', '郁李仁', '六轴子', '蔓荆子', '杜仲', '椿皮', '肉桂', '厚朴', '黄柏', '秦皮', '牡丹皮', '松皮',
                  '地骨皮', '山高梁', '梓白皮', '旱冬瓜', '刺楸', '地枫皮', '阿魏', '琥珀', '没药', '藤黄', '血竭', '乳香', '松香', '安息香', '人参', '附子',
                  '白及', '白蔹', '白前', '白芍', '白术', '白薇', '白芷', '百部', '苍术', '拳参', '草乌', '柴胡', '常山', '中药材赤芍', '川乌', '川芎',
                  '大黄', '丹参', '当归', '党参', '地榆', '莪术', '防风', '防己', '干姜', '甘草', '甘松', '菝葜', '甘遂', '藁本', '干葛根', '狗脊',
                  '山药片', '半夏', '虎杖', '牛膝', '黄精', '黄连', '黄芪', '黄芩', '姜黄', '桔梗', '药用魔芋', '苦参', '细辛', '缬草', '龙胆', '芦根',
                  '麦冬', '知母', '藕节', '前胡', '茜草', '羌活', '秦艽', '三七', '山柰', '商陆', '射干', '升麻', '地黄', '天冬', '天麻', '乌药', '仙茅',
                  '香附', '薤白', '续断', '玄参', '玉竹', '郁金', '远志', '木香', '泽泻', '重楼', '紫草', '紫菀', '三棱', '狼毒', '藜芦', '漏芦', '玛咖',
                  '首乌', '板蓝根', '苁蓉', '牛大力', '西洋参', '川断', '熟地', '元胡', '地参', '贝母', '牛蒡', '石参根', '牛奶树根', '鲜巴戟', '沙参',
                  '五指毛桃', '北沙参', '川明参', '天南星', '贯众', '茶根', '南板蓝根', '骨碎朴', '岗梅根', '太子参', '白茅根', '威灵仙', '天花粉', '珠子参',
                  '淡竹叶', '皂角刺', '金果榄', '墓头回', '四叶参', '千斤拔', '炮姜', '桑白皮', '两面针', '白鲜皮', '八角莲', '夏天无', '猕猴桃根', '地下明珠',
                  '制白附片', '良姜', '冰球子', '白头翁', '白首乌', '穿山龙', '天葵子', '紫花前胡', '菊苣根', '罗汉参', '黄参', '\u200b青阳参', '石斛', '百部草',
                  '土茯苓', '假蒟', '九龙藤', '火头根', '五指山参', '了哥王', '雪上一枝蒿', '东革阿里', '走马胎', '五加皮', '黄药子', '滴水珠', '朱砂莲',
                  '大气(菊)根', '牛尾菜', '分心木', '红参果', '铁筷子', '铁包金', '树萝卜', '天门冬', '隔山消', '龙齿', '朱砂', '磁石', '胆矾', '皂矾', '红粉',
                  '滑石', '硫黄', '雌黄', '芒硝', '硼砂', '绿矾', '秋石', '石膏', '石燕', '云母', '龙骨', '雄黄', '赭石', '玛瑙', '铅丹', '硇砂', '水银',
                  '麦饭石', '阳起石', '葛花', '干丁香', '红花', '槐花', '干菊花', '莲房', '莲须', '梅花', '蒲黄', '辛夷', '柿蒂', '桂花瓣', '芫花', '桃花',
                  '金银花', '黄花倒水莲', '石斛花', '三七花', '霸王花', '款冬花', '杜仲雄花', '雪莲', '山银花', '玫瑰茄', '黄莲花', '西洋参花', '藏红花', '合欢花',
                  '槐米', '橘红花', '园参花', '玫瑰花', '密蒙花', '中药材鸡冠花', '猪苓', '雷丸', '竹黄', '桑黄', '红椎菇', '红菌', '桦树茸', '椴木赤芝', '虫草',
                  '血耳', '肉苁蓉', '茯苓', '茯神', '云芝', '昆布', '灵芝', '马勃', '虫草花', '沉香', '黄藤', '钩藤', '桂枝', '桃枝', '苦木', '薜荔',
                  '樟木', '桑枝', '苏木', '檀香', '通草', '柘木', '竹茹', '鸡血藤', '龙须藤', '槐枝', '蛇莲', '海风藤', '络石藤', '红藤', '夜交藤', '藤三七',
                  '寄生', '青风藤', '鸡矢藤', '雷公藤', '忍冬藤', '薄荷', '大蓟', '萹蓄', '木贼', '菊苣', '菥蓂', '藿香', '荆芥', '卷柏', '麻黄', '佩兰',
                  '中药材青蒿', '葎草', '蛇莓', '锁阳', '瓦松', '香薷', '钩吻', '小蓟', '茵陈', '血党', '泽兰', '当药', '败酱', '洪连', '浮萍', '龙葵',
                  '瞿麦', '地椒', '泽漆', '香茅', '山香', '其它全草类', '灯芯草', '菟丝子', '车前草', '中药麦冬草', '仙草', '半枝莲', '韭菜子', '益母草', '蒲公英',
                  '伸筋草', '鬼针草', '夏枯草', '石黄皮', '地胆草', '野菰', '红雪茶', '白雪茶', '天青地白', '绞股蓝', '马蹄金', '金钱草', '景天三七', '鹿含草',
                  '鸡骨草', '红根草', '红景天', '透骨草', '一枝黄花', '独角莲', '石橄榄', '明日叶', '豆瓣绿', '牛耳枫', '苦地丁', '石上柏', '猫须草', '金线莲',
                  '野菊', '血参', '化石草', '铁篱笆（药材）', '阴地蕨', '紫花地丁', '岩白菜', '车前子', '过江龙', '塘边耦', '赤车', '黄牛茶', '见血清', '胆木',
                  '三丫苦', '贯叶连翘', '小肺筋草', '肺心草', '芦巴子', '山慈菇', '中药材回春草', '青叶胆', '金丝草', '斑叶兰', '蜂窝草', '忧遁草', '石吊兰', '穿心草',
                  '瓜子金', '蛇菰', '苦荬菜', '四叶莲', '回心草（药材）', '草苁蓉', '六月霜', '理肺散', '青箭', '葛菌', '红丝线', '冷水花', '一支箭', '凤尾草',
                  '落新妇', '大还魂', '腹水草', '刘寄奴', '野老鹤草', '伤寒草', '血满草', '荔枝草', '观音草', '接骨草', '白花蛇舌草', '白屈菜', '双肾草', '灯盏细辛',
                  '颠茄草', '墨旱莲', '列当', '中药材车前草', '牛至草', '百蕊草', '兔耳风', '兔儿伞', '肾炎草', '石见穿', '石蝉草', '磨盘草', '四块瓦', '中药材迷迭香',
                  '绣花针', '蜈蚣草', '委陵菜', '野生石仙桃', '叶下珠', '仙鹤草', '独脚柑', '七星剑', '牛筋草', '六棱菊', '博落回', '水蓼', '小蓬草', '韩信草',
                  '獐牙菜', '七叶胆', '小金牛草', '天胡荽', '猪鬃草', '倒扣草', '扁蓄', '霍香', '广霍香', '风柜斗草', '白毛蛇', '豨签草', '土大黄', '翻白草',
                  '无患子', '鹿茸草', '白背叶', '断肠草', '三叶青', '公石松', '犁头草', '蒌叶', '水黄连', '田基黄']
    user_agent = 'Mozilla/4.0 (compatible;MSIE5.5;windows NT)'
    headers = {'User-Agent': user_agent}
    Host = 'http://www.zyctd.com/Search/Index?keyword='
    book = xlwt.Workbook(encoding='utf-8')
    sheet = book.add_sheet('drugBaseDetail')
    head = ['drugName','otherName','newTime','productionArea','characteristic','img']  # 表头
    num=1
    for h in range(len(head)):
        sheet.write(0, h, head[h])  # 写入表头
    for key in yaocaiName:
        try:
            res = requests.get(Host + key, headers=headers)
            soup = BeautifulSoup(res.text, 'html.parser', from_encoding='utf-8')
            mainContent = soup.find_all(class_="breedContBox")[0]
            img = mainContent.find_all(class_="picImg")[0].get('src')
            otherName = mainContent.find_all("a")[1].text
            newTime = mainContent.find_all("a")[2].text
            productionArea = mainContent.find_all("a")[3].text
            characteristic = mainContent.find_all("a")[4].text
            sheet.write(num, 0,key)
            sheet.write(num, 1,otherName)
            sheet.write(num, 2,newTime)
            sheet.write(num, 3,productionArea)
            sheet.write(num, 4,characteristic)
            sheet.write(num, 5,img)
            num+=1
        except:
            sheet.write(num, 0, key)
            sheet.write(num, 1, "暂无")
            sheet.write(num, 2, "暂无")
            sheet.write(num, 3, "暂无")
            sheet.write(num, 4, "暂无")
            sheet.write(num, 5, "暂无")
            num += 1
        if num%100==0:
            print(num)




    book.save('drugBaseDetail.xls')

if __name__=="__main__":
    saveBase()














